# SQL Operators

## Arithmetic Operators (+, -, *, /)
Perform mathematical calculations on numeric data.

In [ ]:
DROP TABLE IF EXISTS products_op;

In [ ]:
CREATE TABLE products_op (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50),
    price INT,
    quantity INT
);

In [ ]:
DESCRIBE products_op;

In [ ]:
INSERT INTO products_op (product_id, product_name, price, quantity) VALUES
(1, 'Laptop', 50000, 2),
(2, 'Mouse', 500, 10),
(3, 'Keyboard', 1500, 5);

In [ ]:
SELECT * FROM products_op;

In [ ]:
SELECT product_name, price + quantity AS add_result
FROM products_op;

In [ ]:
SELECT product_name, price - quantity AS sub_result
FROM products_op;

In [ ]:
SELECT product_name, price * quantity AS total_cost
FROM products_op;

In [ ]:
SELECT product_name, price / quantity AS unit_div
FROM products_op;

### Invalid query (division by zero)

In [ ]:
SELECT price / 0
FROM products_op;

### Use NULLIF function

In [ ]:
SELECT price / NULLIF(quantity, 0)
FROM products_op;

## Relational Operators (=, <, >, <=, >=, <>, !=)
Compare values to return TRUE/FALSE.

In [ ]:
DROP TABLE IF EXISTS emp_rel;

In [ ]:
CREATE TABLE emp_rel (
    emp_id INT PRIMARY KEY,
    emp_name VARCHAR(50),
    salary INT
);

In [ ]:
DESCRIBE emp_rel;

In [ ]:
INSERT INTO emp_rel (emp_id, emp_name, salary) VALUES
(1, 'Arjun Raj', 60000),
(2, 'Priya Nair', 45000),
(3, 'Ramesh Kumar', 70000);

In [ ]:
SELECT * FROM emp_rel;

In [ ]:
SELECT *
FROM emp_rel
WHERE salary >= 50000;

In [ ]:
SELECT *
FROM emp_rel
WHERE salary <> 60000;

In [ ]:
SELECT *
FROM emp_rel
WHERE salary = 45000;

### Invalid query (datatype mismatch)

In [ ]:
SELECT *
FROM emp_rel
WHERE salary = 'ABC';

## Logical Operators (AND, OR, NOT)
Combine multiple conditions in WHERE clause.

In [ ]:
DROP TABLE IF EXISTS cust_logic;

In [ ]:
CREATE TABLE cust_logic (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50),
    city VARCHAR(50),
    status VARCHAR(20)
);

In [ ]:
DESCRIBE cust_logic;

In [ ]:
INSERT INTO cust_logic VALUES (1, 'Arjun Raj', 'Bengaluru', 'Active');

INSERT INTO cust_logic VALUES (2, 'Priya Nair', 'Chennai', 'Inactive');

INSERT INTO cust_logic VALUES (3, 'Ramesh Kumar', 'Hyderabad', 'Active');

INSERT INTO cust_logic VALUES (4, 'Kavita Desai', 'Mumbai', 'Active');

In [ ]:
SELECT * FROM cust_logic;

In [ ]:
SELECT *
FROM cust_logic
WHERE city = 'Chennai'
  AND status = 'Inactive';

In [ ]:
SELECT *
FROM cust_logic
WHERE city = 'Mumbai'
   OR city = 'Chennai';

In [ ]:
SELECT *
FROM cust_logic
WHERE NOT city = 'Delhi';

In [ ]:
SELECT *
FROM cust_logic
WHERE status = 'Active'
  AND customer_id > 1;

## Special Operators

### Concatenation Operator

In [ ]:
SELECT CONCAT(customer_name, ' from ', city) AS full_info
FROM cust_logic;

In [ ]:
SELECT CONCAT(customer_name, status)
FROM cust_logic;

### IN Operator

In [ ]:
SELECT *
FROM cust_logic
WHERE city IN ('Mumbai', 'Chennai');

In [ ]:
SELECT *
FROM cust_logic
WHERE customer_id IN (1, 2, 3);

### BETWEEN Operator

In [ ]:
SELECT *
FROM emp_rel
WHERE salary BETWEEN 45000 AND 70000;

### LIKE Operator

In [ ]:
SELECT *
FROM cust_logic
WHERE customer_name LIKE 'A%';

In [ ]:
SELECT *
FROM cust_logic
WHERE customer_name LIKE '%S';

### IS NULL Operator

In [ ]:
SELECT *
FROM cust_logic
WHERE status IS NULL;

In [ ]:
SELECT *
FROM cust_logic
WHERE status IS NOT NULL;

In [ ]:
SELECT * 
FROM cust_logic 
WHERE Status != NULL; -- No results

In [ ]:
SELECT *
FROM emp_rel
WHERE salary > (
    SELECT salary
    FROM emp_rel
    WHERE emp_name = 'Priya Nair'
);

In [ ]:
SELECT *
FROM emp_rel
WHERE salary > ANY (
    SELECT salary
    FROM emp_rel
);

### EXISTS Operator

In [ ]:
SELECT *
FROM cust_logic c
WHERE EXISTS (
    SELECT 1
    FROM emp_rel e
    WHERE e.emp_id = c.customer_id
);

## Cheat Sheet
| Operator Type | Symbols / Keywords | Example | Notes |
|---------------|--------------------|---------|-------|
| Arithmetic | +, -, *, / | `Price * Quantity` | Watch divide by zero |
| Relational | =, <, >, <=, >=, <>, != | `Salary >= 50000` | Datatype mismatch â†’ error |
| Logical | AND, OR, NOT | `City='Chennai' AND Status='Active'` | Combine conditions |
| Concatenation | `||` | `FirstName || ' ' || LastName` | Cast non-strings |
| IN | IN (...) | `City IN ('Mumbai','Chennai')` | Values must match datatype |
| BETWEEN | BETWEEN ... AND ... | `Salary BETWEEN 40k AND 60k` | Inclusive of bounds |
| LIKE | LIKE pattern | `Name LIKE 'A%'` | Supports % and _ wildcards |
| IS NULL | IS NULL / IS NOT NULL | `Email IS NULL` | `= NULL` is invalid |
| ANY / ALL | ANY, ALL | `Salary > ALL (subquery)` | Subquery must return comparable datatype |
| EXISTS | EXISTS (subquery) | `EXISTS (SELECT 1 ...)` | Checks for existence of rows |